name: "sample"
layer {
  name: "data"
  type: "Data"
  top: "data"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.039215684
  }
  data_param {
    source: "/home/zsy/DeepLearning/caffe/examples/mytest_scale/mnist_train_lmdb"
    batch_size: 10
    backend: LMDB
  }
}

layer {
	name: "imagescaled"
	type: "ImageScale"
	bottom: "data"
	top: "imagescaled"
	image_scale_param {
	  out_height: 128
	  out_width: 128
	  visualize: true
	}
}
